БухЭксп/Enums/CW_ПриоритетыСистемныхСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПриоритетыСистемныхСообщений</Name>
			<Comment>Приоритеты по RFC 5424</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>p0</Name>
					<Comment>Emergency (panic)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p1</Name>
					<Comment>Alert (alert)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p2</Name>
					<Comment>Critical (crit)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p3</Name>
					<Comment>Error (error)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p4</Name>
					<Comment>Warning (warning)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p5</Name>
					<Comment>Notice (notice)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p6</Name>
					<Comment>Informational (info)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>p7</Name>
					<Comment>Debug (debug)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonModules/CW_Журнал_ПИ/Ext/Module.bsl
// может быть числом или строкой, или перечислением
Функция ПриоритетСообщения(Знач ЗначениеПриоритета) Экспорт 
	// --- 
	
	ТипПриоритета = ТипЗнч(ЗначениеПриоритета);
	
	Если ТипПриоритета = Тип("ПеречислениеСсылка.CW_ПриоритетыСистемныхСообщений") Тогда
		
		Возврат(ЗначениеПриоритета);		
	
	ИначеЕсли ТипПриоритета=Тип("Строка") Тогда
		
		Если ЗначениеПриоритета = "debug" Тогда
			
			Возврат(Перечисления.CW_ПриоритетыСистемныхСообщений.p7);
			
		ИначеЕсли ЗначениеПриоритета = "info" Тогда
			
			Возврат(Перечисления.CW_ПриоритетыСистемныхСообщений.p6);
			
		ИначеЕсли ЗначениеПриоритета = "notice" Тогда
			
			Возврат(Перечисления.CW_ПриоритетыСистемныхСообщений.p5);
			
		ИначеЕсли ЗначениеПриоритета = "warning" Тогда
			
			Возврат(Перечисления.CW_ПриоритетыСистемныхСообщений.p4);
			
		ИначеЕсли ЗначениеПриоритета = "error" Тогда
			
			Возврат(Перечисления.CW_ПриоритетыСистемныхСообщений.p3);
			
		ИначеЕсли ЗначениеПриоритета = "crit" Тогда
			
			Возврат(Перечисления.CW_ПриоритетыСистемныхСообщений.p2);
			
		ИначеЕсли ЗначениеПриоритета = "alert" Тогда
			
			Возврат(Перечисления.CW_ПриоритетыСистемныхСообщений.p1);
			
		ИначеЕсли ЗначениеПриоритета = "panic" Тогда
			
			Возврат(Перечисления.CW_ПриоритетыСистемныхСообщений.p0);
			
		КонецЕсли; 
		
	ИначеЕсли ТипПриоритета=Тип("Число") Тогда 
		
		Если (ЗначениеПриоритета >=0 )И(ЗначениеПриоритета <= 7) Тогда
			
			Возврат(Перечисления.CW_ПриоритетыСистемныхСообщений["p"+Строка(ЗначениеПриоритета)]);
			
		Иначе
			
			Возврат(Перечисления.CW_ПриоритетыСистемныхСообщений.ПустаяСсылка());
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// --- 

Функция ИсточникСообщения(Знач СтроковыйИдентификатор) Экспорт 
	// --- 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ИсточникиСистемныхСообщений.Ссылка
	|ИЗ
	|	Справочник.CW_ИсточникиСистемныхСообщений КАК CW_ИсточникиСистемныхСообщений
	|ГДЕ
	|	CW_ИсточникиСистемныхСообщений.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", СокрЛП(СтроковыйИдентификатор));
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТипС = _сф.к_ПервыйЭлемент(ТЗ);
	Если ТипС <> Неопределено Тогда
		
		Возврат(ТипС.Ссылка);
		
	Иначе
		
		ТипСО = Справочники.CW_ИсточникиСистемныхСообщений.СоздатьЭлемент();
		ТипСО.Наименование = СтроковыйИдентификатор;
		ТипСО.ОбменДанными.Загрузка = Истина;
		ТипСО.Записать();
		
		Возврат(ТипСО.Ссылка);
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// --- 

Функция ТребуетсяИсторияДляОбъектаМетаданных(Метаданное) Экспорт 
	
	СсылкаНаОбъект = Справочники.CW_МетаданныеКонфигурации.НайтиПоНаименованию(Метаданное);
	
	Если СсылкаНаОбъект.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СсылкаНаОбъект.ДляИсторииОбъектов;
	
КонецФункции

Функция СписокМетаданныхДляИсторииОбъектов() Экспорт 
	
	Запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_МетаданныеКонфигурации.Ссылка КАК Ссылка,
	               |	CW_МетаданныеКонфигурации.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.CW_МетаданныеКонфигурации КАК CW_МетаданныеКонфигурации
	               |ГДЕ
	               |	CW_МетаданныеКонфигурации.ДляИсторииОбъектов";
	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	
КонецФункции
